##Это оптимизированная версия, потому что мне стало стыдно

def chislo_v_propis(n):  ##Создаем определенную функцию
    chisla = ["нуль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять", "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать",
                   "семнадцать", "восемнадцать", "девятнадцать"]
    tens = ["", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"] ##Составляем списки слов, которые программа будет использовать

    if n < 20:  ##Если число принадлежит отрезку [0; 20],
        return chisla[n]  ##то выводится слово из списка исключений с индексом введенного числа
    else:  ##Если число не принадлежит выше написанным отрезкам, то
        tens_n = n // 10  ##десятки отпределяются путем деления введенного числа на 10 и выводятся из списка десятков с индексом, который получился, разделив число на 10,
        units_n = n % 10  ##единицы определяются путем выделения остатка от деления введенного числа на 10 и выводятся из списка единиц с индексом, который получился, выделив остаток
        if units_n == 0: ##Если введенное число равно десятку без единиц(единицы=нуль), то выводится только одно слово из списка десятков с индексом десятка
            return tens[tens_n]
        else:
            return tens[tens_n] + " " + chisla[units_n]  ##Если введенное число равно десятку+единицы(и при этом единица не равна нулю), то пропись выводится путем слова из
        ##списка десятков, пробела и слова из списка единиц


while True:
    try:
        pers_number = int(input("Введите число от 0 до 99: "))  ##Запрашиваем у пользователя число и сохраняем его в переменной

        if 0 <= pers_number <= 99:  ##Проверка, что введенное число входит в отрезок [0; 99]
            print(chislo_v_propis(pers_number))  ##Запускаем определенную функцию с числом пользователя и сразу выводим ответ прописью
            repeat = input("Хотите повторить (да/нет)? ").lower()  ##После выполнения функции спрашиваем пользователя, хочет ли он ввести еще одно число
            if repeat != "да":  ##Есои пользователь не захотел повторять
                break  # Выход из цикла, если пользователь не хочет повторять
        else:
            print("Ошибка ввода. Введите число от 0 до 99")  ##Если пользователь ввел число, не входящее в отрезок
    except ValueError:
        print("Вы должны ввести число.")  ##Если пользователь ввел не число
