ef degrees():  ##Создаем определенную функцию
    while True:
        try:
            pers_temp = input("Введите температуру с пометкой о единице измерения температуры(C или F): ")  ##Запрашиваем у пользователя данные и сохраняем их в переменной
            chislo_temp = int(pers_temp[:-1])  ##В новой переменной сохраняем всё, кроме последнего символа(буквы-единицы измерения)

            if "C" in pers_temp:  ##Если градусы в цельсиях
                CinF = (9/5) * chislo_temp + 32
                print(f"{chislo_temp}°C = {CinF:.2f}°F")
            elif "F" in pers_temp:  ##Если градусы в фаренгейтах
                FinC = (5/9) * (chislo_temp - 32)
                print(f"{chislo_temp}°F = {FinC:.2f}°C")
            else:
                print("Единица измерения должна быть C или F! Пример: 36C или 97F")  ##Если пользователь ввёл не ту букву или не ввёл букву вообще
            repeat = input(
                "Хотите повторить (да/нет)? ").lower()  ##После выполнения функции спрашиваем пользователя, хочет ли он ввести еще одно число
            if repeat != "да":  ##Если пользователь не захотел повторять
                break  # Выход из цикла, если пользователь не хочет повторять
        except ValueError:
            print("Вы должны ввести число и единицу измерения.")  ##Если пользователь ввел не число
degrees()  ##Запуск функции
